Repository: marcosremar/dumont-cloud
Catalog: cli/translations/*/LC_MESSAGES/messages.po
Languages: es

source: Configuration:
es: Configuración:

source: Configure API key
es: Configurar clave API

source: Show configuration
es: Mostrar configuración

source: Set API key
es: Establecer clave API

source: Set API URL
es: Establecer URL de API

source: Authentication
es: Autenticación

source: System
es: Sistema

source: Instances
es: Instancias

source: Market (Spot)
es: Mercado (Spot)

source: Savings
es: Ahorros

source: Serverless GPU
es: GPU Serverless

source: Warm Pool
es: Pool en Espera

source: Jobs
es: Trabajos

source: Snapshots
es: Instantáneas

source: Models
es: Modelos

source: Hibernation
es: Hibernación

source: Fine-tune
es: Ajuste Fino

source: Direct API:
es: API Directa:

source: List all endpoints
es: Listar todos los endpoints

source: GET request
es: Solicitud GET

source: POST request
es: Solicitud POST

source: Wizard:
es: Asistente:

source: Quick GPU deploy
es: Despliegue rápido de GPU

source: Dumont Cloud CLI - GPU Cloud Management
es: Dumont Cloud CLI - Gestión de GPU en la Nube

source: API URL (default: ~/.dumont/config.json or localhost:8000)
es: URL de API (por defecto: ~/.dumont/config.json o localhost:8000)

source: API Key (default: ~/.dumont/config.json or DUMONT_API_KEY)
es: Clave API (por defecto: ~/.dumont/config.json o DUMONT_API_KEY)

source: Debug mode
es: Modo depuración

source: Language for CLI output (default: en, or LANGUAGE env var)
es: Idioma para la salida del CLI (por defecto: en, o variable de entorno LANGUAGE)

source: Command or resource
es: Comando o recurso

source: Subcommand or action
es: Subcomando o acción

source: Additional arguments
es: Argumentos adicionales

source: ❌ Usage: dumont config set-key <api_key>
es: ❌ Uso: dumont config set-key <clave_api>

source: ❌ Usage: dumont config set-url <url>
es: ❌ Uso: dumont config set-url <url>

source: ❌ Unknown subcommand: {subcommand}
es: ❌ Subcomando desconocido: {subcommand}

source: Available: setup, show, set-key, set-url, clear
es: Disponibles: setup, show, set-key, set-url, clear

source: 🧙 Wizard Deploy - Quick GPU Provisioning
es: 🧙 Asistente de Despliegue - Aprovisionamiento Rápido de GPU

source: Usage: dumont wizard deploy [gpu] [options]
es: Uso: dumont wizard deploy [gpu] [opciones]

source: Options:
es: Opciones:

source: gpu=<name> GPU type (e.g., 'RTX 4090', 'A100')
es: gpu=<nombre> Tipo de GPU (ej., 'RTX 4090', 'A100')

source: speed=<mode> fast (default), slow, ultrafast
es: speed=<modo> fast (por defecto), slow, ultrafast

source: price=<$> Max price per hour (default: 2.0)
es: price=<$> Precio máximo por hora (por defecto: 2.0)

source: region=<name> Region filter (default: global)
es: region=<nombre> Filtro de región (por defecto: global)

source: ❌ Usage: dumont model install <instance_id> <model_id>
es: ❌ Uso: dumont model install <id_instancia> <id_modelo>

source: ❌ Usage: dumont models deploy <type> <model_id> [options]
es: ❌ Uso: dumont models deploy <tipo> <id_modelo> [opciones]

source: ❌ Usage: dumont models {subcommand} <deployment_id>
es: ❌ Uso: dumont models {subcommand} <id_despliegue>

source: ❌ Could not load API endpoints
es: ❌ No se pudieron cargar los endpoints de la API

source: 🚀 Dumont Cloud API Endpoints
es: 🚀 Endpoints de la API de Dumont Cloud

source: 💡 Usage:
es: 💡 Uso:

source: ❌ Missing parameters: {params}
es: ❌ Parámetros faltantes: {params}

source: ❌ Usage: dumont api {method} <path> [args...]
es: ❌ Uso: dumont api {method} <ruta> [args...]

source: ❌ Invalid format
es: ❌ Formato inválido

source: List endpoints
es: Listar endpoints

source: 🚀 Dumont Cloud CLI - Available Commands
es: 🚀 Dumont Cloud CLI - Comandos Disponibles

source: 💡 Examples:
es: 💡 Ejemplos:

source: Direct API access
es: Acceso directo a la API

source: ❌ Could not connect to backend.
es: ❌ No se pudo conectar al backend.

source: 💡 Check if the backend is running:
es: 💡 Verifica si el backend está en ejecución:

source: GPU Job Commands
es: Comandos de Trabajos GPU

source: Fine-Tuning Commands
es: Comandos de Ajuste Fino

source: Instance Management
es: Gestión de Instancias

source: Snapshot Commands
es: Comandos de Instantáneas

source: Warm Pool Commands
es: Comandos de Pool en Espera

source: Failover Commands
es: Comandos de Conmutación por Error

source: Serverless Mode Commands
es: Comandos de Modo Serverless

source: Authentication Commands
es: Comandos de Autenticación

source: Settings Commands
es: Comandos de Configuración

source: Savings & Cost Commands
es: Comandos de Ahorros y Costos

source: History Commands
es: Comandos de Historial

source: Spot GPU Commands
es: Comandos de GPU Spot

source: {resource} Commands
es: Comandos de {resource}

source: ❌ Unknown action '{action}' for {resource}
es: ❌ Acción desconocida '{action}' para {resource}

source: Usage: dumont {resource} <action> [options]
es: Uso: dumont {resource} <acción> [opciones]

source: Actions:
es: Acciones:

source: Examples:
es: Ejemplos:

source: 🚀 Dumont Cloud CLI - {count} commands available
es: 🚀 Dumont Cloud CLI - {count} comandos disponibles

source: Usage: dumont <resource> <action> [args...]
es: Uso: dumont <recurso> <acción> [args...]

source: ❌ Unknown resource: {resource}
es: ❌ Recurso desconocido: {resource}

source: 💡 Available resources: {resources}
es: 💡 Recursos disponibles: {resources}

source: ❌ Required parameter missing: {param}
es: ❌ Parámetro requerido faltante: {param}

source: 💡 Usage: dumont {resource} {action} <{param}>
es: 💡 Uso: dumont {resource} {action} <{param}>

source: ❌ Invalid JSON: {error}
es: ❌ JSON inválido: {error}

source: ❌ Usage: dumont auth login <email> <password>
es: ❌ Uso: dumont auth login <email> <contraseña>

source: 🔧 Dumont Cloud CLI Setup
es: 🔧 Configuración de Dumont Cloud CLI

source: Current API URL: {url}
es: URL de API actual: {url}

source: New URL (Enter to keep):
es: Nueva URL (Enter para mantener):

source: Current API Key: {key}
es: Clave API actual: {key}

source: No API Key configured.
es: No hay clave API configurada.

source: To get your API Key:
es: Para obtener tu clave API:

source: 1. Go to https://cloud.dumont.ai/settings
es: 1. Ve a https://cloud.dumont.ai/settings

source: 2. Click 'Generate API Key'
es: 2. Haz clic en 'Generar Clave API'

source: 3. Copy the generated key
es: 3. Copia la clave generada

source: API Key (Enter to keep):
es: Clave API (Enter para mantener):

source: ✅ Configuration saved to ~/.dumont/config.json
es: ✅ Configuración guardada en ~/.dumont/config.json

source: 📋 Current Configuration
es: 📋 Configuración Actual

source: API URL: {url}
es: URL de API: {url}

source: API Key: {key}
es: Clave API: {key}

source: API Key: (not configured)
es: Clave API: (no configurada)

source: File: {file}
es: Archivo: {file}

source: Status: ✅ Configured
es: Estado: ✅ Configurado

source: Status: ❌ Not configured
es: Estado: ❌ No configurado

source: Run: dumont config setup
es: Ejecuta: dumont config setup

source: ✅ API Key saved!
es: ✅ ¡Clave API guardada!

source: ✅ API URL configured: {url}
es: ✅ URL de API configurada: {url}

source: ✅ Configuration removed
es: ✅ Configuración eliminada

source: ℹ️ No configuration to remove
es: ℹ️ No hay configuración que eliminar

source: ⚠️ CLI not configured!
es: ⚠️ ¡CLI no configurado!

source: To use the Dumont CLI, you need to configure your API Key.
es: Para usar el CLI de Dumont, necesitas configurar tu clave API.

source: Do you want to configure now? [Y/n]:
es: ¿Deseas configurar ahora? [S/n]:

source: You can configure later with:
es: Puedes configurar más tarde con:

source: Or set the environment variable:
es: O establece la variable de entorno:

source: 🚀 Installing model '{model}' on instance {instance}
es: 🚀 Instalando modelo '{model}' en la instancia {instance}

source: 📡 Step 1: Getting instance information...
es: 📡 Paso 1: Obteniendo información de la instancia...

source: ❌ Could not fetch instances. Make sure you are logged in.
es: ❌ No se pudieron obtener las instancias. Asegúrate de haber iniciado sesión.

source: ❌ Instance {id} not found
es: ❌ Instancia {id} no encontrada

source: 💡 Available instances: {instances}
es: 💡 Instancias disponibles: {instances}

source: ❌ Instance is not running (status: {status})
es: ❌ La instancia no está en ejecución (estado: {status})

source: 💡 Start the instance first: dumont instance resume {id}
es: 💡 Inicia la instancia primero: dumont instance resume {id}

source: ❌ Could not get SSH connection info
es: ❌ No se pudo obtener la información de conexión SSH

source: IP: {ip}, Port: {port}
es: IP: {ip}, Puerto: {port}

source: ✓ Instance found: {gpu} @ {ip}:{port}
es: ✓ Instancia encontrada: {gpu} @ {ip}:{port}

source: 📦 Step 2: Installing Ollama...
es: 📦 Paso 2: Instalando Ollama...

source: ✓ Ollama already installed
es: ✓ Ollama ya está instalado

source: ✓ Ollama installed successfully
es: ✓ Ollama instalado correctamente

source: ✓ Ollama service running
es: ✓ Servicio Ollama en ejecución

source: ⚠ Ollama service may not be running
es: ⚠ El servicio Ollama podría no estar en ejecución

source: ⚠ Installation output: {output}
es: ⚠ Salida de instalación: {output}

source: ⚠ Errors: {errors}
es: ⚠ Errores: {errors}

source: 🤖 Step 3: Pulling model '{model}'...
es: 🤖 Paso 3: Descargando modelo '{model}'...

source: (This may take a while depending on model size)
es: (Esto puede tardar dependiendo del tamaño del modelo)

source: ✓ Model '{model}' pulled successfully
es: ✓ Modelo '{model}' descargado correctamente

source: ❌ Failed to pull model
es: ❌ Error al descargar el modelo

source: Output: {output}
es: Salida: {output}

source: Errors: {errors}
es: Errores: {errors}

source: ✅ Installation Complete!
es: ✅ ¡Instalación Completa!

source: 📋 Connection Details:
es: 📋 Detalles de Conexión:

source: Model: {model}
es: Modelo: {model}

source: Ollama API: {url}
es: API Ollama: {url}

source: 🔧 Quick Test Commands:
es: 🔧 Comandos de Prueba Rápida:

source: 📦 Deployed Models
es: 📦 Modelos Desplegados

source: ❌ Could not fetch models. Make sure you are logged in.
es: ❌ No se pudieron obtener los modelos. Asegúrate de haber iniciado sesión.

source: No models deployed yet.
es: Aún no hay modelos desplegados.

source: 💡 Deploy a model:
es: 💡 Despliega un modelo:

source: Model: {model}
es: Modelo: {model}

source: Type: {type}
es: Tipo: {type}

source: Status: {status} ({message})
es: Estado: {status} ({message})

source: Key: {key}...
es: Clave: {key}...

source: Cost: ${cost:.2f}/h
es: Costo: ${cost:.2f}/h

source: Progress: {progress:.0f}%
es: Progreso: {progress:.0f}%

source: 📋 Available Model Templates
es: 📋 Plantillas de Modelos Disponibles

source: ❌ Could not fetch templates.
es: ❌ No se pudieron obtener las plantillas.

source: Type: {type}
es: Tipo: {type}

source: Port: {port}
es: Puerto: {port}

source: GPU: {memory}GB+ required
es: GPU: {memory}GB+ requerido

source: Popular models:
es: Modelos populares:

source: 🚀 Deploying {type} model: {model}
es: 🚀 Desplegando modelo {type}: {model}

source: Unknown error
es: Error desconocido

source: Failed to connect
es: Error de conexión

source: ❌ Deploy failed: {error}
es: ❌ Despliegue fallido: {error}

source: ✅ Deployment started!
es: ✅ ¡Despliegue iniciado!

source: Estimated time: ~{minutes} minutes
es: Tiempo estimado: ~{minutes} minutos

source: ⏳ Waiting for deployment to complete...
es: ⏳ Esperando a que se complete el despliegue...

source: ⚠ Could not check status
es: ⚠ No se pudo verificar el estado

source: ✅ Deployment complete!
es: ✅ ¡Despliegue completado!

source: API Key: {key}
es: Clave API: {key}

source: Cost: ${cost:.2f}/h
es: Costo: ${cost:.2f}/h

source: ❌ Deployment failed: {message}
es: ❌ Despliegue fallido: {message}

source: ⚠ Timeout waiting for deployment
es: ⚠ Tiempo de espera agotado para el despliegue

source: ❌ Deployment {id} not found
es: ❌ Despliegue {id} no encontrado

source: 📦 Deployment Details
es: 📦 Detalles del Despliegue

source: ⏹️ Stopping deployment {id}...
es: ⏹️ Deteniendo despliegue {id}...

source: ❌ Failed to stop deployment
es: ❌ Error al detener el despliegue

source: ✅ Deployment stopped
es: ✅ Despliegue detenido

source: 🗑️ Deleting deployment {id}...
es: 🗑️ Eliminando despliegue {id}...

source: ✅ Deployment deleted
es: ✅ Despliegue eliminado

source: ❌ Could not fetch logs for {id}
es: ❌ No se pudieron obtener los logs de {id}

source: 📋 Logs for {id}
es: 📋 Logs de {id}

source: No logs available
es: No hay logs disponibles

source: 🚀 Wizard Deploy Starting
es: 🚀 Iniciando Asistente de Despliegue

source: Any
es: Cualquiera

source: Speed: {speed}
es: Velocidad: {speed}

source: Max Price: ${price}/hr
es: Precio Máx: ${price}/hr

source: Region: {region}
es: Región: {region}

source: ❌ Could not import wizard service: {error}
es: ❌ No se pudo importar el servicio del asistente: {error}

source: Make sure you're running from the dumontcloud directory
es: Asegúrate de estar ejecutando desde el directorio dumontcloud

source: ❌ No Vast.ai API key found
es: ❌ No se encontró la clave API de Vast.ai

source: Set VAST_API_KEY environment variable or configure via settings
es: Establece la variable de entorno VAST_API_KEY o configúrala en ajustes

source: 📡 Step 1: Searching for offers...
es: 📡 Paso 1: Buscando ofertas...

source: ❌ No offers found matching criteria
es: ❌ No se encontraron ofertas que coincidan con los criterios

source: 💡 Try relaxing filters (higher price, different GPU, different region)
es: 💡 Intenta relajar los filtros (precio más alto, GPU diferente, región diferente)

source: ✓ Found {count} offers
es: ✓ Se encontraron {count} ofertas

source: 🔄 Step 2: Starting multi-start deployment...
es: 🔄 Paso 2: Iniciando despliegue multi-inicio...

source: Strategy: Create {batch_size} machines per batch, up to {max_batches} batches
es: Estrategia: Crear {batch_size} máquinas por lote, hasta {max_batches} lotes

source: Timeout: {timeout}s per batch
es: Tiempo límite: {timeout}s por lote

source: [{elapsed}s] Status: {status}
es: [{elapsed}s] Estado: {status}

source: Batch {batch}/{max_batches} - Machines created: {count}
es: Lote {batch}/{max_batches} - Máquinas creadas: {count}

source: Machines created: {machines}
es: Máquinas creadas: {machines}

source: Machines tried: {count}
es: Máquinas intentadas: {count}

source: Machines created: {count}
es: Máquinas creadas: {count}

source: Machines destroyed: {count}
es: Máquinas destruidas: {count}

source: ✅ Deploy Complete!
es: ✅ ¡Despliegue Completo!

source: 📋 Instance Details:
es: 📋 Detalles de la Instancia:

source: Instance ID: {id}
es: ID de Instancia: {id}

source: Unknown
es: Desconocido

source: SSH Port: {port}
es: Puerto SSH: {port}

source: Price: ${price:.3f}/hr
es: Precio: ${price:.3f}/hr

source: Speed: {speed:.0f} Mbps
es: Velocidad: {speed:.0f} Mbps

source: Ready in: {time:.1f}s
es: Listo en: {time:.1f}s

source: 🔗 SSH Command:
es: 🔗 Comando SSH:

source: 💻 Code Server:
es: 💻 Servidor de Código:

source: 💾 Instance ID saved: {id}
es: 💾 ID de Instancia guardado: {id}

source: SkyPilot Task for Fine-Tuning with Unsloth
es: Tarea SkyPilot para Ajuste Fino con Unsloth

source: Generated by Dumont Cloud Fine-Tuning Service
es: Generado por el Servicio de Ajuste Fino de Dumont Cloud

source: === Setting up Unsloth Fine-Tuning Environment ===
es: === Configurando Entorno de Ajuste Fino con Unsloth ===

source: Install Unsloth and dependencies
es: Instalar Unsloth y dependencias

source: Create output directory
es: Crear directorio de salida

source: Pre-download model to cache
es: Pre-descargar modelo a caché

source: Pre-downloading base model:
es: Pre-descargando modelo base:

source: === Setup Complete ===
es: === Configuración Completa ===

source: === Starting Fine-Tuning with Unsloth ===
es: === Iniciando Ajuste Fino con Unsloth ===

source: Base Model:
es: Modelo Base:

source: LoRA Rank:
es: Rango LoRA:

source: Learning Rate:
es: Tasa de Aprendizaje:

source: Epochs:
es: Épocas:

source: Batch Size:
es: Tamaño de Lote:

source: Max Sequence Length:
es: Longitud Máxima de Secuencia:

source: Configuration from template
es: Configuración desde plantilla

source: DUMONT CLOUD FINE-TUNING JOB
es: TRABAJO DE AJUSTE FINO DE DUMONT CLOUD

source: Started at:
es: Iniciado a las:

source: Load model with Unsloth (4-bit quantization)
es: Cargar modelo con Unsloth (cuantización de 4 bits)

source: Loading model:
es: Cargando modelo:

source: Auto-detect (float16 or bfloat16)
es: Auto-detectar (float16 o bfloat16)

source: Model loaded successfully!
es: ¡Modelo cargado exitosamente!

source: Add LoRA adapters
es: Añadir adaptadores LoRA

source: Adding LoRA adapters (rank=
es: Añadiendo adaptadores LoRA (rango=

source: LoRA adapters added!
es: ¡Adaptadores LoRA añadidos!

source: Load dataset
es: Cargar dataset

source: Load from URL
es: Cargar desde URL

source: Loading dataset from URL:
es: Cargando dataset desde URL:

source: Load from local file
es: Cargar desde archivo local

source: Loading dataset from local file:
es: Cargando dataset desde archivo local:

source: No JSON/JSONL files found in dataset directory
es: No se encontraron archivos JSON/JSONL en el directorio del dataset

source: Found dataset files:
es: Archivos de dataset encontrados:

source: Try to load from HuggingFace
es: Intentar cargar desde HuggingFace

source: Loading dataset from HuggingFace:
es: Cargando dataset desde HuggingFace:

source: Dataset loaded:
es: Dataset cargado:

source: examples
es: ejemplos

source: Format dataset based on format type
es: Formatear dataset según el tipo de formato

source: Format Alpaca-style dataset
es: Formatear dataset estilo Alpaca

source: Format ShareGPT-style dataset
es: Formatear dataset estilo ShareGPT

source: Assume raw text format
es: Asumir formato de texto plano

source: Dataset must have text column for raw format
es: El dataset debe tener columna de texto para formato plano

source: Dataset formatted with
es: Dataset formateado con

source: Training arguments
es: Argumentos de entrenamiento

source: Create trainer
es: Crear entrenador

source: Train!
es: ¡Entrenar!

source: STARTING TRAINING
es: INICIANDO ENTRENAMIENTO

source: TRAINING COMPLETE!
es: ¡ENTRENAMIENTO COMPLETADO!

source: Save LoRA adapters
es: Guardar adaptadores LoRA

source: Saving LoRA adapters to:
es: Guardando adaptadores LoRA en:

source: Save training stats
es: Guardar estadísticas de entrenamiento

source: Training Statistics:
es: Estadísticas de Entrenamiento:

source: Final Loss:
es: Pérdida Final:

source: Runtime:
es: Tiempo de Ejecución:

source: Samples/sec:
es: Muestras/seg:

source: FINE-TUNING COMPLETE!
es: ¡AJUSTE FINO COMPLETADO!

source: Model saved to:
es: Modelo guardado en:

source: Stats saved to:
es: Estadísticas guardadas en:

source: === Fine-Tuning Job Complete ===
es: === Trabajo de Ajuste Fino Completado ===

source: Dumont Cloud - Live Docs
es: Dumont Cloud - Documentación en Vivo

source: Live Docs
es: Documentación en Vivo

source: Strategy
es: Estrategia

source: Marketing Roadmap
es: Hoja de Ruta de Marketing

source: Engineering
es: Ingeniería

source: Project README
es: README del Proyecto

source: ← Back to App
es: ← Volver a la Aplicación

source: Loading documentation...
es: Cargando documentación...

source: Live Documentation System
es: Sistema de Documentación en Vivo

source: No documents found. Add .md files to Live-Doc/content/
es: No se encontraron documentos. Añade archivos .md a Live-Doc/content/

source: Error loading menu
es: Error al cargar el menú

source: Open Console (F12 or Ctrl+Shift+I) for full details.
es: Abre la Consola (F12 o Ctrl+Shift+I) para más detalles.

source: Document not found
es: Documento no encontrado

source: Error loading document:
es: Error al cargar el documento:

source: Copy URL
es: Copiar URL

source: Copied!
es: ¡Copiado!
